spec/fixtures/responses/payment_requests/list.json

{
  "paymentRequests": [
    {
      "paymentRequestToken": "paymentrequesttoken1",
      "amountInCents": "123",
      "currency": "EUR",
      "description": "Last night's dinner",
      "created": "2016-06-09T18:00:00.000Z",
      "expired": null,
      "status": "OPEN",
      "bankAccountYieldedTooFast": false,
      "externalId": "Invoice: 4567",
      "payments": [
        {
          "paymentToken": "paymenttoken1",
          "counterPartyName": "E. Xample",
          "amountInCents": "123",
          "amountCurrency": "EUR",
          "description": "Payment for tikkie",
          "created": "2016-06-09T18:00:00.000Z",
          "onlinePaymentStatus": "NEW"
        }
      ]
    }
  ],
  "totalElements": 2
}
